ox_docs/history/history10/KBe21hist201retFreewriteWar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-27 Mon 11:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>29 March 2021 war freewrite</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">29 March 2021 war freewrite</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-09-27 Mon 11:51</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org16342b3">1. why does war happen</a>
<ul>
<li><a href="#org167ea95">1.1. when people disagree and resort to force</a>
<ul>
<li><a href="#orgadba416">1.1.1. why cant countries just take each other to court?</a></li>
</ul>
</li>
<li><a href="#orgaa3062b">1.2. want more (greed + scarcity)</a>
<ul>
<li><a href="#orgbcbbb65">1.2.1. easiest way to get stuff might be to take it from someone else</a></li>
<li><a href="#orgcde56a8">1.2.2. power is almost by definition scarce, and other relative measures</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd9247e4">2. what would be required to put an end to war</a>
<ul>
<li><a href="#orga7d536b">2.1. in most small groups, its possible to find a shared goal. however, on a national level we often don't plan that far ahead so we don't really work towards complex shared goals</a></li>
<li><a href="#org047615e">2.2. emergence towers (wait but why)</a></li>
<li><a href="#org3d1f6fc">2.3. just/moral leaders</a></li>
<li><a href="#org8b0944e">2.4. sufficient mutually assured destruction</a></li>
<li><a href="#orgec63c46">2.5. total domination</a></li>
<li><a href="#orgcf08a3b">2.6. uncooporative populus (if people don't want to fight/mutiny)</a></li>
</ul>
</li>
<li><a href="#org9ddcbf9">3. is there such a thing as a just (or good, ethical, righteous) war; why/whynot</a>
<ul>
<li><a href="#org0ccdbe5">3.1. for there to be a just war, there must be a common 'good'.</a></li>
<li><a href="#org0be9b1e">3.2. however, is goodness relative? there seem to be some things which are generally considered good by most people, but its unclear that those are necessarily always good for everyone.</a></li>
<li><a href="#orgb5bb483">3.3. if there is something that all parties agree are good, then that would be a just war?</a></li>
<li><a href="#org71ec40a">3.4. maybe there is a real ground-truth good, but we can't know what it is</a></li>
<li><a href="#orgfc4be67">3.5. WWII: allied powers agreed that the holocaust was bad, but the nazis thought they were doing the right thing</a></li>
<li><a href="#org29900b1">3.6. violence is not always bad. extend subjective experience</a></li>
<li><a href="#orga8111eb">3.7. war isn't just but one side may be in the moral correct</a></li>
<li><a href="#orgd62162e">3.8. all violence is unjust? there is always a more peaceful way</a></li>
<li><a href="#org8082e0f">3.9. abstract wars</a></li>
<li><a href="#org8f81284">3.10. its difficult to measure the value of a life (soldiers vs civilians, citizens vs those of other countries)</a></li>
<li><a href="#org95381ff">3.11. countries might go against their own morals for the 'greater good'</a></li>
</ul>
</li>
</ul>
</div></div>
</div>
<div id="outline-container-org16342b3" class="outline-2">
<h2 id="org16342b3"><span class="section-number-2">1</span> why does war happen</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org167ea95" class="outline-3">
<h3 id="org167ea95"><span class="section-number-3">1.1</span> when people disagree and resort to force</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgadba416" class="outline-4">
<h4 id="orgadba416"><span class="section-number-4">1.1.1</span> why cant countries just take each other to court?</h4>
</div>
</div>
<div id="outline-container-orgaa3062b" class="outline-3">
<h3 id="orgaa3062b"><span class="section-number-3">1.2</span> want more (greed + scarcity)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgbcbbb65" class="outline-4">
<h4 id="orgbcbbb65"><span class="section-number-4">1.2.1</span> easiest way to get stuff might be to take it from someone else</h4>
</div>
<div id="outline-container-orgcde56a8" class="outline-4">
<h4 id="orgcde56a8"><span class="section-number-4">1.2.2</span> power is almost by definition scarce, and other relative measures</h4>
</div>
</div>
</div>
<div id="outline-container-orgd9247e4" class="outline-2">
<h2 id="orgd9247e4"><span class="section-number-2">2</span> what would be required to put an end to war</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga7d536b" class="outline-3">
<h3 id="orga7d536b"><span class="section-number-3">2.1</span> in most small groups, its possible to find a shared goal. however, on a national level we often don't plan that far ahead so we don't really work towards complex shared goals</h3>
</div>
<div id="outline-container-org047615e" class="outline-3">
<h3 id="org047615e"><span class="section-number-3">2.2</span> emergence towers (wait but why)</h3>
</div>
<div id="outline-container-org3d1f6fc" class="outline-3">
<h3 id="org3d1f6fc"><span class="section-number-3">2.3</span> just/moral leaders</h3>
</div>
<div id="outline-container-org8b0944e" class="outline-3">
<h3 id="org8b0944e"><span class="section-number-3">2.4</span> sufficient mutually assured destruction</h3>
</div>
<div id="outline-container-orgec63c46" class="outline-3">
<h3 id="orgec63c46"><span class="section-number-3">2.5</span> total domination</h3>
</div>
<div id="outline-container-orgcf08a3b" class="outline-3">
<h3 id="orgcf08a3b"><span class="section-number-3">2.6</span> uncooporative populus (if people don't want to fight/mutiny)</h3>
</div>
</div>
<div id="outline-container-org9ddcbf9" class="outline-2">
<h2 id="org9ddcbf9"><span class="section-number-2">3</span> is there such a thing as a just (or good, ethical, righteous) war; why/whynot</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0ccdbe5" class="outline-3">
<h3 id="org0ccdbe5"><span class="section-number-3">3.1</span> for there to be a just war, there must be a common 'good'.</h3>
</div>
<div id="outline-container-org0be9b1e" class="outline-3">
<h3 id="org0be9b1e"><span class="section-number-3">3.2</span> however, is goodness relative? there seem to be some things which are generally considered good by most people, but its unclear that those are necessarily always good for everyone.</h3>
</div>
<div id="outline-container-orgb5bb483" class="outline-3">
<h3 id="orgb5bb483"><span class="section-number-3">3.3</span> if there is something that all parties agree are good, then that would be a just war?</h3>
</div>
<div id="outline-container-org71ec40a" class="outline-3">
<h3 id="org71ec40a"><span class="section-number-3">3.4</span> maybe there is a real ground-truth good, but we can't know what it is</h3>
</div>
<div id="outline-container-orgfc4be67" class="outline-3">
<h3 id="orgfc4be67"><span class="section-number-3">3.5</span> WWII: allied powers agreed that the holocaust was bad, but the nazis thought they were doing the right thing</h3>
</div>
<div id="outline-container-org29900b1" class="outline-3">
<h3 id="org29900b1"><span class="section-number-3">3.6</span> violence is not always bad. extend subjective experience</h3>
</div>
<div id="outline-container-orga8111eb" class="outline-3">
<h3 id="orga8111eb"><span class="section-number-3">3.7</span> war isn't just but one side may be in the moral correct</h3>
</div>
<div id="outline-container-orgd62162e" class="outline-3">
<h3 id="orgd62162e"><span class="section-number-3">3.8</span> all violence is unjust? there is always a more peaceful way</h3>
</div>
<div id="outline-container-org8082e0f" class="outline-3">
<h3 id="org8082e0f"><span class="section-number-3">3.9</span> abstract wars</h3>
</div>
<div id="outline-container-org8f81284" class="outline-3">
<h3 id="org8f81284"><span class="section-number-3">3.10</span> its difficult to measure the value of a life (soldiers vs civilians, citizens vs those of other countries)</h3>
</div>
<div id="outline-container-org95381ff" class="outline-3">
<h3 id="org95381ff"><span class="section-number-3">3.11</span> countries might go against their own morals for the 'greater good'</h3>
<div class="outline-text-3" id="text-3-11">
</div>
</div>
</div>
</div>
</body>
</html>
