docs/history/history10/KBe21hist201retFreewriteWar.tex
% Created 2021-09-11 Sat 16:40
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{29 March 2021 war freewrite}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={29 March 2021 war freewrite},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{why does war happen}
\label{sec:org9d2b1ed}
\subsection{when people disagree and resort to force}
\label{sec:org082e09c}
\subsubsection{why cant countries just take each other to court?}
\label{sec:orgfa0cf66}
\subsection{want more (greed + scarcity)}
\label{sec:org3cb20ec}
\subsubsection{easiest way to get stuff might be to take it from someone else}
\label{sec:orgb01772e}
\subsubsection{power is almost by definition scarce, and other relative measures}
\label{sec:orgc688ebc}
\section{what would be required to put an end to war}
\label{sec:org440ee72}
\subsection{in most small groups, its possible to find a shared goal. however, on a national level we often don't plan that far ahead so we don't really work towards complex shared goals}
\label{sec:org1daec57}
\subsection{emergence towers (wait but why)}
\label{sec:orgaa28fb0}
\subsection{just/moral leaders}
\label{sec:org0bfe46d}
\subsection{sufficient mutually assured destruction}
\label{sec:org8db9a9d}
\subsection{total domination}
\label{sec:org54d836f}
\subsection{uncooporative populus (if people don't want to fight/mutiny)}
\label{sec:orgb883ae1}
\section{is there such a thing as a just (or good, ethical, righteous) war; why/whynot}
\label{sec:orgc46c87e}
\subsection{for there to be a just war, there must be a common 'good'.}
\label{sec:org62c47c9}
\subsection{however, is goodness relative? there seem to be some things which are generally considered good by most people, but its unclear that those are necessarily always good for everyone.}
\label{sec:org66bc4e1}
\subsection{if there is something that all parties agree are good, then that would be a just war?}
\label{sec:org2716044}
\subsection{maybe there is a real ground-truth good, but we can't know what it is}
\label{sec:org2bf855c}
\subsection{WWII: allied powers agreed that the holocaust was bad, but the nazis thought they were doing the right thing}
\label{sec:org3058480}
\subsection{violence is not always bad. extend subjective experience}
\label{sec:org55d7971}
\subsection{war isn't just but one side may be in the moral correct}
\label{sec:orgf424129}
\subsection{all violence is unjust? there is always a more peaceful way}
\label{sec:org344ad27}
\subsection{abstract wars}
\label{sec:org3fd9fb8}
\subsection{its difficult to measure the value of a life (soldiers vs civilians, citizens vs those of other countries)}
\label{sec:orgd8bae3b}
\subsection{countries might go against their own morals for the 'greater good'}
\label{sec:org33bd748}
\end{document}
